## Processin SIM data

In [6]:
from pysus.online_data.SIM import download
from pysus.preprocessing.decoders import translate_variables_SIM
from pysus.preprocessing.SIM import group_and_count, redistribute_missing, redistribute_cid_chapter

In [10]:
df = download('ac',2010)
df

,contador,ORIGEM,TIPOBITO,DTOBITO,HORAOBITO,NATURAL,DTNASC,IDADE,SEXO,RACACOR,...,DTCADASTRO,ATESTANTE,FONTEINV,DTRECEBIM,UFINFORM,CB_PRE,MORTEPARTO,DTCADINF,TPOBITOCOR,DTCADINV
0,1,1,2,06082010,2000,831,09041945,465,2,,...,19082010,,,20092010,,R98,,,,
1,2,1,2,06082010,1300,812,20011912,498,1,,...,19082010,,2,01102010,,R98,,,,
2,3,1,2,02102010,1700,812,17032010,306,2,4,...,05012011,3,,10022011,,R98,,,,
3,4,1,2,07042010,2300,,07042010,005,2,1,...,06052010,1,,20072010,,O689,,,,
4,5,1,2,13052010,0030,812,04081971,438,1,1,...,21062010,5,,20072010,,X999,,,,
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3004,3005,1,2,28092010,0100,,20041958,452,2,4,...,20102010,,,11112010,,I619,,,,
3005,3006,1,2,14102010,1015,,24031928,482,1,1,...,06122010,2,,19012011,,I219,,,,
3006,3007,1,2,21112010,0650,,11121955,454,2,1,...,09122010,5,,17012011,,C349,,,,
3007,3008,1,2,10112010,0500,,07071955,455,1,1,...,04012011,2,,19012011,,C787,,,,
3008,3009,1,2,10102010,1240,,07051976,434,2,4,...,28122010,2,,26112010,,I739,,,,

In [11]:
variables = ['CODMUNRES','SEXO','IDADE_ANOS','CID10_CHAPTER']
df = translate_variables_SIM(df,age_classes=True,classify_cid10_chapters=True)
df = df[variables]
df

     CODMUNRES       SEXO    IDADE_ANOS CID10_CHAPTER
0       120040   Feminino  [65.0, 66.0)            18
1       120040  Masculino   [90.0, inf)             9
2       120040   Feminino    [0.0, 1.0)            18
3       120042   Feminino    [0.0, 1.0)            16
4       120020  Masculino  [38.0, 39.0)            20
...        ...        ...           ...           ...
3004    120040   Feminino  [52.0, 53.0)             9
3005    120040  Masculino  [82.0, 83.0)             9
3006    120040   Feminino  [54.0, 55.0)             2
3007       nan  Masculino  [55.0, 56.0)             2
3008    120040   Feminino  [34.0, 35.0)             9

[3009 rows x 4 columns]

In [12]:
counts = group_and_count(df,variables)
counts

       CODMUNRES      SEXO  IDADE_ANOS CID10_CHAPTER  COUNTS
0         120001  Feminino  [0.0, 1.0)             1     1.0
1         120001  Feminino  [0.0, 1.0)             2     0.0
2         120001  Feminino  [0.0, 1.0)             3     0.0
3         120001  Feminino  [0.0, 1.0)             4     0.0
4         120001  Feminino  [0.0, 1.0)             5     0.0
...          ...       ...         ...           ...     ...
107911       nan       nan         nan            15     0.0
107912       nan       nan         nan            16     0.0
107913       nan       nan         nan            17     0.0
107914       nan       nan         nan            18     0.0
107915       nan       nan         nan            20     0.0

[107916 rows x 5 columns]

In [13]:
counts['COUNTS_ORIGINAL'] = counts['COUNTS']
counts = redistribute_missing(counts,['CODMUNRES','SEXO','IDADE_ANOS'])
counts

,CODMUNRES,SEXO,IDADE_ANOS,CID10_CHAPTER,COUNTS,COUNTS_ORIGINAL
0,120001,Feminino,"[0.0, 1.0)",1,1.0,1.0
1,120001,Feminino,"[0.0, 1.0)",2,0.0,0.0
2,120001,Feminino,"[0.0, 1.0)",3,0.0,0.0
3,120001,Feminino,"[0.0, 1.0)",4,0.0,0.0
4,120001,Feminino,"[0.0, 1.0)",5,0.0,0.0
...,...,...,...,...,...,...
101638,120080,Masculino,"[90.0, inf)",15,0.0,0.0
101639,120080,Masculino,"[90.0, inf)",16,0.0,0.0
101640,120080,Masculino,"[90.0, inf)",17,0.0,0.0
101641,120080,Masculino,"[90.0, inf)",18,0.0,0.0
101642,120080,Masculino,"[90.0, inf)",20,1.0,1.0

In [14]:
counts = redistribute_cid_chapter(counts,['CODMUNRES','SEXO','IDADE_ANOS'])
counts

,CODMUNRES,SEXO,IDADE_ANOS,CID10_CHAPTER,COUNTS,COUNTS_ORIGINAL
0,120001,Feminino,"[0.0, 1.0)",1,1.000000,1.0
1,120001,Feminino,"[0.0, 1.0)",2,0.000000,0.0
2,120001,Feminino,"[0.0, 1.0)",3,0.000000,0.0
3,120001,Feminino,"[0.0, 1.0)",4,0.000000,0.0
4,120001,Feminino,"[0.0, 1.0)",5,0.000000,0.0
...,...,...,...,...,...,...
101637,120080,Masculino,"[90.0, inf)",14,0.000000,0.0
101638,120080,Masculino,"[90.0, inf)",15,0.000000,0.0
101639,120080,Masculino,"[90.0, inf)",16,0.000000,0.0
101640,120080,Masculino,"[90.0, inf)",17,0.000000,0.0
101642,120080,Masculino,"[90.0, inf)",20,1.106748,1.0